In [13]:
 ![png]('/users/daviankalopez/Documents/DataEnrichment/Image 8-30-22 at 10.18 PM.png'')

zsh:1: unmatched '

In [2]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection_str ="mysql+pymysql://root:DreAj2345@localhost/new_db"

In [6]:
#create the engine
engine = create_engine(connection_str)

In [8]:
engine

Engine(mysql+pymysql://root:***@localhost/new_db)

In [9]:
# use if/else statement 
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [10]:
database_exists(connection_str)

True

In [11]:
import pandas as pd
df = pd.read_csv('/Users/daviankalopez/Downloads/data.csv')
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [14]:
df.to_sql('Books', engine, if_exists = 'replace')

7

In [15]:
q = """SELECT * FROM Books LIMIT 5;"""
pd.read_sql(q, engine)

,index,First Name,Last Name,Email,Book Title,Book Author
0,0,John,Doe,JD@books.com,The Shining,Stephen King
1,1,John,Doe,JD@books.com,It,Stephen King
2,2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen